IlleniumDillon/MM32LLD/MM32/Sfr/MM32_UARTReg.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2022-10-31 10:33:40
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2022-10-31 20:08:00
 * @FilePath: \CODE\MM32\Sfr\MM32_UARTReg.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#ifndef _MM32_UARTREG_H_
#define _MM32_UARTREG_H_

#include "MM32_RegBase.h"

#include "MM32_UARTRegDef.h"

#define MOUDLE_UART2		((MM32_UART*)UART2_BASE)

#define MOUDLE_UART3		((MM32_UART*)UART3_BASE)

#define MOUDLE_UART4		((MM32_UART*)UART4_BASE)

#define MOUDLE_UART5		((MM32_UART*)UART5_BASE)

#define MOUDLE_UART7		((MM32_UART*)UART7_BASE)

#define MOUDLE_UART8		((MM32_UART*)UART8_BASE)

#define MOUDLE_UART1		((MM32_UART*)UART1_BASE)

#define MOUDLE_UART6		((MM32_UART*)UART6_BASE)

#define UART2_TDR		((MM32_UART_TDR*)(UART2_BASE+0X00))

#define UART2_RDR		((MM32_UART_RDR*)(UART2_BASE+0X04))

#define UART2_CSR		((MM32_UART_CSR*)(UART2_BASE+0X08))

#define UART2_ISR		((MM32_UART_ISR*)(UART2_BASE+0X0C))

#define UART2_IER		((MM32_UART_IER*)(UART2_BASE+0X10))

#define UART2_ICR		((MM32_UART_ICR*)(UART2_BASE+0X14))

#define UART2_GCR		((MM32_UART_GCR*)(UART2_BASE+0X18))

#define UART2_CCR		((MM32_UART_CCR*)(UART2_BASE+0X1C))

#define UART2_BRR		((MM32_UART_BRR*)(UART2_BASE+0X20))

#define UART2_FRA		((MM32_UART_FRA*)(UART2_BASE+0X24))

#define UART2_RXADDR 		((MM32_UART_RXADDR *)(UART2_BASE+0X28))

#define UART2_RXMASK 		((MM32_UART_RXMASK *)(UART2_BASE+0X2C))

#define UART2_SCR 		((MM32_UART_SCR *)(UART2_BASE+0X30))

#define UART2_IDLR		((MM32_UART_IDLR*)(UART2_BASE+0X34))

#define UART2_ABRCR		((MM32_UART_ABRCR*)(UART2_BASE+0X38))

#define UART2_IRDA		((MM32_UART_IRDA*)(UART2_BASE+0X3C))

#define UART3_TDR		((MM32_UART_TDR*)(UART3_BASE+0X00))

#define UART3_RDR		((MM32_UART_RDR*)(UART3_BASE+0X04))

#define UART3_CSR		((MM32_UART_CSR*)(UART3_BASE+0X08))

#define UART3_ISR		((MM32_UART_ISR*)(UART3_BASE+0X0C))

#define UART3_IER		((MM32_UART_IER*)(UART3_BASE+0X10))

#define UART3_ICR		((MM32_UART_ICR*)(UART3_BASE+0X14))

#define UART3_GCR		((MM32_UART_GCR*)(UART3_BASE+0X18))

#define UART3_CCR		((MM32_UART_CCR*)(UART3_BASE+0X1C))

#define UART3_BRR		((MM32_UART_BRR*)(UART3_BASE+0X20))

#define UART3_FRA		((MM32_UART_FRA*)(UART3_BASE+0X24))

#define UART3_RXADDR 		((MM32_UART_RXADDR *)(UART3_BASE+0X28))

#define UART3_RXMASK 		((MM32_UART_RXMASK *)(UART3_BASE+0X2C))

#define UART3_SCR 		((MM32_UART_SCR *)(UART3_BASE+0X30))

#define UART3_IDLR		((MM32_UART_IDLR*)(UART3_BASE+0X34))

#define UART3_ABRCR		((MM32_UART_ABRCR*)(UART3_BASE+0X38))

#define UART3_IRDA		((MM32_UART_IRDA*)(UART3_BASE+0X3C))

#define UART4_TDR		((MM32_UART_TDR*)(UART4_BASE+0X00))

#define UART4_RDR		((MM32_UART_RDR*)(UART4_BASE+0X04))

#define UART4_CSR		((MM32_UART_CSR*)(UART4_BASE+0X08))

#define UART4_ISR		((MM32_UART_ISR*)(UART4_BASE+0X0C))

#define UART4_IER		((MM32_UART_IER*)(UART4_BASE+0X10))

#define UART4_ICR		((MM32_UART_ICR*)(UART4_BASE+0X14))

#define UART4_GCR		((MM32_UART_GCR*)(UART4_BASE+0X18))

#define UART4_CCR		((MM32_UART_CCR*)(UART4_BASE+0X1C))

#define UART4_BRR		((MM32_UART_BRR*)(UART4_BASE+0X20))

#define UART4_FRA		((MM32_UART_FRA*)(UART4_BASE+0X24))

#define UART4_RXADDR 		((MM32_UART_RXADDR *)(UART4_BASE+0X28))

#define UART4_RXMASK 		((MM32_UART_RXMASK *)(UART4_BASE+0X2C))

#define UART4_SCR 		((MM32_UART_SCR *)(UART4_BASE+0X30))

#define UART4_IDLR		((MM32_UART_IDLR*)(UART4_BASE+0X34))

#define UART4_ABRCR		((MM32_UART_ABRCR*)(UART4_BASE+0X38))

#define UART4_IRDA		((MM32_UART_IRDA*)(UART4_BASE+0X3C))

#define UART5_TDR		((MM32_UART_TDR*)(UART5_BASE+0X00))

#define UART5_RDR		((MM32_UART_RDR*)(UART5_BASE+0X04))

#define UART5_CSR		((MM32_UART_CSR*)(UART5_BASE+0X08))

#define UART5_ISR		((MM32_UART_ISR*)(UART5_BASE+0X0C))

#define UART5_IER		((MM32_UART_IER*)(UART5_BASE+0X10))

#define UART5_ICR		((MM32_UART_ICR*)(UART5_BASE+0X14))

#define UART5_GCR		((MM32_UART_GCR*)(UART5_BASE+0X18))

#define UART5_CCR		((MM32_UART_CCR*)(UART5_BASE+0X1C))

#define UART5_BRR		((MM32_UART_BRR*)(UART5_BASE+0X20))

#define UART5_FRA		((MM32_UART_FRA*)(UART5_BASE+0X24))

#define UART5_RXADDR 		((MM32_UART_RXADDR *)(UART5_BASE+0X28))

#define UART5_RXMASK 		((MM32_UART_RXMASK *)(UART5_BASE+0X2C))

#define UART5_SCR 		((MM32_UART_SCR *)(UART5_BASE+0X30))

#define UART5_IDLR		((MM32_UART_IDLR*)(UART5_BASE+0X34))

#define UART5_ABRCR		((MM32_UART_ABRCR*)(UART5_BASE+0X38))

#define UART5_IRDA		((MM32_UART_IRDA*)(UART5_BASE+0X3C))

#define UART7_TDR		((MM32_UART_TDR*)(UART7_BASE+0X00))

#define UART7_RDR		((MM32_UART_RDR*)(UART7_BASE+0X04))

#define UART7_CSR		((MM32_UART_CSR*)(UART7_BASE+0X08))

#define UART7_ISR		((MM32_UART_ISR*)(UART7_BASE+0X0C))

#define UART7_IER		((MM32_UART_IER*)(UART7_BASE+0X10))

#define UART7_ICR		((MM32_UART_ICR*)(UART7_BASE+0X14))

#define UART7_GCR		((MM32_UART_GCR*)(UART7_BASE+0X18))

#define UART7_CCR		((MM32_UART_CCR*)(UART7_BASE+0X1C))

#define UART7_BRR		((MM32_UART_BRR*)(UART7_BASE+0X20))

#define UART7_FRA		((MM32_UART_FRA*)(UART7_BASE+0X24))

#define UART7_RXADDR 		((MM32_UART_RXADDR *)(UART7_BASE+0X28))

#define UART7_RXMASK 		((MM32_UART_RXMASK *)(UART7_BASE+0X2C))

#define UART7_SCR 		((MM32_UART_SCR *)(UART7_BASE+0X30))

#define UART7_IDLR		((MM32_UART_IDLR*)(UART7_BASE+0X34))

#define UART7_ABRCR		((MM32_UART_ABRCR*)(UART7_BASE+0X38))

#define UART7_IRDA		((MM32_UART_IRDA*)(UART7_BASE+0X3C))

#define UART8_TDR		((MM32_UART_TDR*)(UART8_BASE+0X00))

#define UART8_RDR		((MM32_UART_RDR*)(UART8_BASE+0X04))

#define UART8_CSR		((MM32_UART_CSR*)(UART8_BASE+0X08))

#define UART8_ISR		((MM32_UART_ISR*)(UART8_BASE+0X0C))

#define UART8_IER		((MM32_UART_IER*)(UART8_BASE+0X10))

#define UART8_ICR		((MM32_UART_ICR*)(UART8_BASE+0X14))

#define UART8_GCR		((MM32_UART_GCR*)(UART8_BASE+0X18))

#define UART8_CCR		((MM32_UART_CCR*)(UART8_BASE+0X1C))

#define UART8_BRR		((MM32_UART_BRR*)(UART8_BASE+0X20))

#define UART8_FRA		((MM32_UART_FRA*)(UART8_BASE+0X24))

#define UART8_RXADDR 		((MM32_UART_RXADDR *)(UART8_BASE+0X28))

#define UART8_RXMASK 		((MM32_UART_RXMASK *)(UART8_BASE+0X2C))

#define UART8_SCR 		((MM32_UART_SCR *)(UART8_BASE+0X30))

#define UART8_IDLR		((MM32_UART_IDLR*)(UART8_BASE+0X34))

#define UART8_ABRCR		((MM32_UART_ABRCR*)(UART8_BASE+0X38))

#define UART8_IRDA		((MM32_UART_IRDA*)(UART8_BASE+0X3C))

#define UART1_TDR		((MM32_UART_TDR*)(UART1_BASE+0X00))

#define UART1_RDR		((MM32_UART_RDR*)(UART1_BASE+0X04))

#define UART1_CSR		((MM32_UART_CSR*)(UART1_BASE+0X08))

#define UART1_ISR		((MM32_UART_ISR*)(UART1_BASE+0X0C))

#define UART1_IER		((MM32_UART_IER*)(UART1_BASE+0X10))

#define UART1_ICR		((MM32_UART_ICR*)(UART1_BASE+0X14))

#define UART1_GCR		((MM32_UART_GCR*)(UART1_BASE+0X18))

#define UART1_CCR		((MM32_UART_CCR*)(UART1_BASE+0X1C))

#define UART1_BRR		((MM32_UART_BRR*)(UART1_BASE+0X20))

#define UART1_FRA		((MM32_UART_FRA*)(UART1_BASE+0X24))

#define UART1_RXADDR 		((MM32_UART_RXADDR *)(UART1_BASE+0X28))

#define UART1_RXMASK 		((MM32_UART_RXMASK *)(UART1_BASE+0X2C))

#define UART1_SCR 		((MM32_UART_SCR *)(UART1_BASE+0X30))

#define UART1_IDLR		((MM32_UART_IDLR*)(UART1_BASE+0X34))

#define UART1_ABRCR		((MM32_UART_ABRCR*)(UART1_BASE+0X38))

#define UART1_IRDA		((MM32_UART_IRDA*)(UART1_BASE+0X3C))

#define UART6_TDR		((MM32_UART_TDR*)(UART6_BASE+0X00))

#define UART6_RDR		((MM32_UART_RDR*)(UART6_BASE+0X04))

#define UART6_CSR		((MM32_UART_CSR*)(UART6_BASE+0X08))

#define UART6_ISR		((MM32_UART_ISR*)(UART6_BASE+0X0C))

#define UART6_IER		((MM32_UART_IER*)(UART6_BASE+0X10))

#define UART6_ICR		((MM32_UART_ICR*)(UART6_BASE+0X14))

#define UART6_GCR		((MM32_UART_GCR*)(UART6_BASE+0X18))

#define UART6_CCR		((MM32_UART_CCR*)(UART6_BASE+0X1C))

#define UART6_BRR		((MM32_UART_BRR*)(UART6_BASE+0X20))

#define UART6_FRA		((MM32_UART_FRA*)(UART6_BASE+0X24))

#define UART6_RXADDR 		((MM32_UART_RXADDR *)(UART6_BASE+0X28))

#define UART6_RXMASK 		((MM32_UART_RXMASK *)(UART6_BASE+0X2C))

#define UART6_SCR 		((MM32_UART_SCR *)(UART6_BASE+0X30))

#define UART6_IDLR		((MM32_UART_IDLR*)(UART6_BASE+0X34))

#define UART6_ABRCR		((MM32_UART_ABRCR*)(UART6_BASE+0X38))

#define UART6_IRDA		((MM32_UART_IRDA*)(UART6_BASE+0X3C))

#endif